////
// //colors must be determined to display in the text
//
var fullscreen =[`<p>הניסוי ימשיך במצב מסך מלא. לחצו על הכפתור למטה כדי להמשיך</p>`];
var preload_msg = 'המשחק טוען מדיה. כבר נתחיל';

var continue_label = 'המשך';
//
var next_label = 'הבא'; // Next button label
//
var previous_label = 'הקודם'; // Previous button label

var reading_dir_left_to_right = false

var BLUE = `כחול`
var RED = `אדום`


var OUTCOMES_TEXT ={
  WIN:'10',
  NO_WIN:'0',
  LOSS:'10',
  NO_LOSS:'0',
}
//---------------------------------------//
// Define langugae parameters.
//---------------------------------------//

var next_key = 'ArrowLeft';

var previous_key = 'ArrowRight';


// runes hebrew

var r_01 = ['U', 'L', 'A', 'G', 'P', 'S', 'W', 'E', 'K', 'D', 'J', 'V'];
var r_02 = ['M', 'R', 'Y', 'H', 'Z', 'C', 'B', 'T', 'X', 'F', 'N', 'Q'];
var r_03 = ['B', 'Z', 'J', 'R', 'V', 'E', 'T', 'F', 'A', 'C', 'L', 'Q'];
var r_04 = ['Y', 'H', 'P', 'M', 'U', 'S', 'K', 'D', 'O', 'I', 'G', 'N'];
var r_05 = ['J', 'W', 'X', 'Z', 'G', 'O', 'C', 'E', 'H', 'Q', 'T', 'Y'];
var r_06 = ['M', 'B', 'K', 'V', 'R', 'P', 'L', 'S', 'U', 'A', 'F', 'N'];

var SAFE = [`נותנים נקודות `];
var DANGEROUS = [`לוקחים נקודות `];

var SAFE_singular = [`נותן נקודות `];
var DANGEROUS_singular = [`לוקח נקודות `];



var instructions_00 = [`<p>ברוכים הבאים למשחק <b>מפעל הרובוטים</b></p><p> נתחיל עם הוראות המשחק - במהלך ההוראות, תוכלו להשתמש במקשי החיצים כדי להתקדם קדימה או לחזור אחורה</p>`];

var instructions_01 = [`במשחק הזה, עליכם לבחון רובוטים בזמן שהם נעים על פס הייצור אל תוך <b>הסורק</b>.`];

var instructions_02 = [`יש הרבה סוגים של רובוטים. תוכלו לזהות את סוג הרובוט לפי <b>הצורה או המספר</b> שנמצאים לו על החזה`];

var instructions_03a = [`לדוגמא, לרובוט מהסוג הזה יש על החזה כוכב.`];

var instructions_03b = [`הנה רובוט מסוג אחר. תוכלו לזהות אותו לפי סמל הפרח שנמצא לו על החזה.`];

var instructions_03c = [`שימו לב לצורות שנמצאות לרובוטים על החזה- זה יעזור לכם להצליח במשחק`];

var instructions_04 = [` כאשר רובוט נכנס לסורק, עליכם להחליט איזו פעולה תרצו לבצע - תוכלו לבחור לגשת אל רובוט או להתעלם ממנו.`];

var instructions_05 = [` חלק מהרובוטים צריכים שתיגשו אליהם וחלק מהרובוטים צריכים שתתעלמו מהם`];

var instructions_05a = [`כדי <b>לגשת</b> לרובוט, לחצו על מקש הרווח במקלדת. </br> כדי <b>להתעלם</b> מרובוט, אל תלחצו על אף מקש.`];

var instructions_05b = [`המטרה שלכם היא ללמוד מה היא הפעולה הטובה ביותר עבור כל סוג של רובוט.`];

var instructions_space = [`מיד נתחיל בתרגול - הניחו את אצבע המורה על מקש הרווח. לחצו על מקש הרווח כשאתם מוכנים להתחיל`];

var instructions_05d = [` שימו לב, אם בחרתם לגשת לרובוט, עליכם ללחוץ על מקש הרווח רק כאשר הסורק מואר`];

var instructions_05e =[`בואו נתאמן עם סוג של רובוט שצריך שתגשו אליו.`];

var instructions_05f =[`לחצו על מקש הרווח כאשר רובוט מהסוג הזה נכנס לסורק.`];

var instructions_05g = [`עכשיו אתם יודעים איך לגשת אל רובוטים במפעל.`];

var instructions_05i = [`בואו נתאמן עם רובוט מסוג שצריך להתעלם ממנו.`];

var instructions_05j = [`כשהרובוט הזה נכנס לסורק, אל תלחצו על אף מקש.`];

var instructions_05k = [`עכשיו אתם יודעים איך לגשת אל רובוטים ואיך להתעלם מהם.`];

var instructions_06_b = [`במפעל, חלק מסוגי הרובוטים `];

var instructions_06_c = [` וחלקם `];

var instructions_06_d = [`רובוטים ש`];

var instructions_06_e =[`לרוב יתנו לכם ${OUTCOMES_TEXT.WIN} נקודות.`];

var instructions_06_f =[`לרוב יקחו מכם ${OUTCOMES_TEXT.LOSS} נקודות.`];

var instructions_06_g =[`המטרה שלכם היא להרוויח כמה שיותר נקודות מרובוטים ש`];

var instructions_06_h =[`ולהמנע מלאבד נקודות לרובוטים ש`];

var instructions_07_a = [` כשהסורק `];
var instructions_07_b = [` הרובוט הוא `];

var instructions_07_d = [`כלומר - ברוב הפעמים הרובוט ייתן לכם ${OUTCOMES_TEXT.WIN} נקודות אם תבחרו בפעולה הנכונה`];

var instructions_07_e = [`ולא ייתן לכם נקודות בכלל אם תבחרו בפעולה הלא נכונה`];

var instructions_07_g = [`אבל לפעמים רובוט ש`];

var instructions_07_h = [`יטעה, ולא ייתן לכם נקודות אפילו אם בחרתם בפעולה נכונה. ולפעמים הרובוט ייתן לכם ${OUTCOMES_TEXT.WIN} נקודות גם אם תבחרו בפעולה הלא נכונה.`];

var instructions_08_a = [` כשהסורק `];

var instructions_08_b = [` הרובוט הוא `];

var instructions_08_d = [`כלומר - ברוב הפעמים הרובוט לא ייקח מכם נקודות אם תבחרו בפעולה הנכונה וייקח מכם ${OUTCOMES_TEXT.LOSS} נקודות אם תבחרו בפעולה הלא נכונה `];


var instructions_08_g = [`אבל לפעמים רובוט ש`];

var instructions_08_h = [`יטעה, ויקח מכם נקודות אפילו אם בחרתם בפעולה נכונה. ולפעמים הרובוט לא יקח מכם נקודות בכלל גם אם תבחרו בפעולה הלא נכונה.`];


var instructions_09_a = [`בואו נתאמן עם רובוט ש`];

var instructions_09_b = [`נסו ללמוד מה הפעולה הנכונה עבור הרובוט הזה.`];

var instructions_09_c = [`זכרו, כדי לגשת לרובוט, לחצו על מקש הרווח. כדי להתעלם ממנו, אל תלחצו על שום דבר.`];

var instructions_10_a = [`אולי למדתם שרובוטים מהסוג הזה ייתנו לכם נקודות אם תגשו אליהם`];

var instructions_10_b = [`בגלל שהרובוט הזה היה רובוט ש`];

var instructions_10_c = [` ברוב הפעמים שניגשתם אליו, הרווחתם ${OUTCOMES_TEXT.WIN}  נקודות.`];

var instructions_10_e = [`גם במהלך המשחק, בחירה בפעולה הנכונה כשהרובוט הוא `];

var instructions_10_f = [`תזכה אתכם בנקודות ברוב הפעמים, אך לא בכל תור.`];

var instructions_11_a = [`בואו נתאמן עם רובוט מסוג אחר, גם הוא `];

var instructions_11_b = [`נסו ללמוד מה הפעולה הנכונה עבור הרובוט הזה.`];

var instructions_12_a = [`אולי שמתם לב שעליכם להתעלם מרובוטים מהסוג הזה.`];

var instructions_12_b = [`בגלל שסוג הרובוט הזה היה רובוט `];

var instructions_12_c = [`ברוב הפעמים שבחרתם בפעולה הנכונה, הרווחתם  ${OUTCOMES_TEXT.WIN}  נקודות`];

var instructions_13_a = [`בואו נתאמן עם רובוט ש`];

var instructions_13_b = [`זכרו, רובוטים ש`];

var instructions_13_c = [`לרוב לא ייקחו מכם נקודות אם תבחרו בפעולה הנכונה, וייקחו ${OUTCOMES_TEXT.LOSS} נקודות אם תבחרו בפעולה הלא נכונה.`];

var instructions_13_d = [`נסו ללמוד מה הפעולה הנכונה עבור הרובוט הזה.`];

var instructions_14_a = [`נהדר. כפי שאולי למדתם, עדיף להתעלם מרובוטים מהסוג הזה.`];

var instructions_14_b = [`בגלל שזה רובוט ש`];

var instructions_14_c = [`, רוב הזמן, אם בחרתם להתעלם מרובוט מהסוג הזה לא אבדתם נקודות.`];

var instructions_14_d = [`בואו נתאמן עם רובוט אחר ש`];

var instructions_14_e = [`, רוב הזמן, אם בחרתם להתעלם מרובוט מהסוג הזה לא אבדתם נקודות.`];

var instructions_14_f = [`נסו ללמוד מה הפעולה הנכונה עבור הרובוט מהסוג הזה.`];

var instructions_15_a = [`אולי למדתם שכדאי לגשת אל רובוטים מהסוג הזה.`];

var instructions_15_b = [`אם בחרתם לגשת אל רובוטים מהסוג הזה, הם בדרך כלל לא לקחו מכם נקודות.`];

var instructions_15_c = [`זכרו: רוב הזמן- אם תבחרו בפעולה הנכונה, רובוטים ש`];

var instructions_15_d = [`יתנו לכם נקודות, ורובוטים ש`];

var instructions_15_e = [`לא ייקחו מכם נקודות.`];

var instructions_15_f = [`אבל, זכרו, לפעמים רובוטים טועים.`];

var instructions_15_g = [`בכל תור, שימו לב גם לצבע האור בסורק וגם לסמל על החזה של הרובוט.`];

var instructions_15_h = [`הסמל מסמן את סוג הרובוט. עליכם ללמוד מה היא הפעולה הנכונה לכל סוג של רובוט`];

var instructions_15_i = [`הצבע של הסורק מסמן האם הרובוט הוא `];

var instructions_15_j = [`או `];


// var instructions_20 = [` בסוף המשחק, המספר הנקודות הכולל שצברתם יומר ל<b>בונוס</b>`];



var instructions_21 = [`<p>מיד נשאל אתכם כמה שאלות על חוקי המשחק</p><p>עליכם לענות נכון על כל השאלות כדי להמשיך`];

var question_mark = `?`;

// // quiz 1
var quiz1_prompt_1 = `מה עליכם לעשות כדי לגשת אל רובוט`;

var quiz1_prompt_2a = `כשהאור בסורק `
var quiz1_prompt_2b = `כמה נקודות תרוויחו אם תבחרו בפעולה הנכונה `

var quiz1_prompt_3a = `כשהאור בסורק  `
var quiz1_prompt_3b = `כמה נקודות תאבדו אם תבחרו בפעולה הנכונה `


var quiz1_prompt_4_a = `נכון או לא נכון: חלק מהרובוטים ש`
var quiz1_prompt_4_b = `יתנו לכם נקודות אם תגשו אליהם, אחרים יתנו לכם נקודות אם תתעלמו מהם.`;


var quiz1_prompt_5 = `נכון או לא נכון: הרובוטים לפעמים טועים בכמות הנקודות שהם נותנים - אפילו אם בחרתם בפעולה הנכונה`;

var quiz1_prompt_6 = `נכון או לא נכון: הנקודות שארוויח ישפיעו על הבונוס שלי`


var quiz1_prompt_7 = `נכון או לא נכון: תמיד עדיף להתעלם מכל הרובוטים ש` ;


var quiz_options_keys = [`להקיש על רווח`, `להקיש על החץ למעלה`, `להקיש על ENTER`];
var quiz_options_outcomes = [`${OUTCOMES_TEXT.WIN}`, `${OUTCOMES_TEXT.NO_WIN}`];
var quiz_options_true_false = [`נכון`, `לא נכון`];



var feedback_err = [` תשובה לא נכונה. שימו לב לרמזים הבאים`];
var feedback_pos = [` תשובה נכונה! כל הכבוד`];



var instructions_24 = [`לפעמים הרובוטים יטעו בכמות הנקודות שהם יקחו מכם או יתנו לכם אפילו אם בחרתם בפעולה הנכונה.`];

var instructions_25 = [` תרוויחו את מירב הנקודות על ידי בחירה בפעולה הנכונה`];

var instructions_26b =[` כמות הנקודות שתרוויחו או תפסידו תלויה במצב הרובוט. האם הוא במצב`];

var instructions_26c =[`  או במצב `]


var instructions_27a = [` כשהסורק `];
var instructions_27b = [` הרובוט במצב `];


var instructions_27c = [` אם תבחרו בפעולה הנכונה, תרוויחו ${OUTCOMES_TEXT.WIN} נקודות, ואם תבחרו בפעולה הלא נכונה, לא תרוויחו נקודות בכלל`];

var instructions_28c = [` אם תבחרו בפעולה הנכונה, לא תאבדו נקודות בכלל, ואם תבחרו בפעולה הלא נכונה, תאבדו ${OUTCOMES_TEXT.LOSS} נקודות`];

var instructions_29c =["חלק מהרובוטים יתנו לכם נקודות אם תגשו אליהם, וחלק יתנו נקודות אם תתעלמו מהם."];
var instructions_30c =["הפעולה הנכונה לכל רובוט נקבעת על ידי הסוג שלו. הסוג מסומן על ידי הסמל שיש לרובוט על החזה ולא על ידי צבע האור בסורק."];

var  instructions_31 = [`<p>כל הכבוד! סיימתם את המשחק. לחצו 'הבא' כדי לסיים ולשמור את נתוני המשחק </p>`];


var ready_00 = [`כל הכבוד! עניתם נכון על כל השאלות `];

var quiz_00 = [`כדי להמשיך, ענו על השאלה הבאה`];

var feedback_trouble_go = [`זכרו, כדי לגשת לרובוט עליכם להקיש על מקש הרווח`,];

var feedback_tryagain_go = [`.נסו לגשת אל הרובוט הזה (הקישו על רווח) `];

var feedback_trouble_nogo = [`זכרו, לא כל רובוט צריך שתיגשו אליו. כדי להתעלם מרובוט פשוט אל תלחצו על אף מקש`];

var feedback_tryagain_nogo = [` נסו להתעלם מהרובוט הזה (אל תעשו כלום)`]




var ready_01_a = [`נתחיל עם המשחק. למשחק שני חלקים. בין החלקים תוכלו לקחת הפסקה.`]


var ready_01_b = [`נתחיל עם החלק הראשון (מתוך שניים) של המשחק. חלק זה יארך כ 8 דקות. לחצו  'הבא' כשאתם מוכנים`];

var pre_ready_02 = [`<p>סיימתם עם החלק הראשון! שימו לב, מיד הנתונים ישמרו במחשב. לחצו הבא כדי לשמור ולהתחיל בהפסקה</p>`];

var ready_02_a = [`נתחיל עם החלק השני (מתוך שניים) של המשחק. חלק זה יארך כ 8 דקות. לחצו  'הבא' כשאתם מוכנים`];
