////
// //colors must be determined to display in the text
//

var fullscreen =[`<p>הניסוי ימשיך במצב מסך מלא. לחצו על הכפתור למטה כדי להמשיך</p>`];
var preload_msg = 'המשחק טוען מדיה. כבר נתחיל';

var continue_label = 'המשך';
//
var next_label = 'הבא'; // Next button label
//
var previous_label = 'הקודם'; // Previous button label

var reading_dir_left_to_right = false

var next_key = 'ArrowLeft';

var previous_key = 'ArrowRight';


var OUTCOMES_TEXT ={CARD_LOW:'0',
                    CARD_HIGH:'10',
                    CERTAIN:'5'};
var play_keys = [`מקש המספר 1 כדי לבחור בקלף השמאלי ומקש המספר 0 כדי לבחור בקלף הימני`] // [`מקשי החצים שמאלה/ימינה`]

var instructions01 = [`<p>ברוכים הבאים למשחק <b>כפול או כלום</b></p><p> נתחיל עם הוראות המשחק - במהלך ההוראות, תוכלו להשתמש במקשי החיצים כדי להתקדם קדימה או לחזור אחורה</p>`];


var instructions02 = [`<p>בכל תור במשחק תצטרכו לבחור קלף אחד מבין שני קלפים: אחד תמיד יהיה גלוי והשני תמיד יהיה הפוך.</p>`];


var instructions03 = [`<p>מבין שני הקלפים, תמיד תראו כמה שווה הקלף הגלוי. אם תבחרו בו, תמיד תרוויחו ${OUTCOMES_TEXT.CERTAIN} נקודות</p>`];


var instructions04 = [`<p>על הקלף ההפוך תמיד יהיה בעל חיים. בחירה בקלף ההפוך תוביל לאחת משתי תוצאות אפשריות</p>`];

var instructions05a = [`<p>יש סיכוי שהקלף שווה ${OUTCOMES_TEXT.CARD_HIGH} נקודות</p>`];
var instructions05b = [`<p>ויש סיכוי שהקלף שווה ${OUTCOMES_TEXT.CARD_LOW} נקודות</p>`];


var instructions06 = [`<p>בכל תור עליכם לבחור האם לזכות ב${OUTCOMES_TEXT.CERTAIN} נקודות בוודאות או להפוך את הקלף עם בעל החיים בשביל הזדמנות לזכות ב ${OUTCOMES_TEXT.CARD_HIGH} נקודות</p>`];

var instructions07a = [`<p>המשחק מכיל קלפים ממספר חפיסות שונות. כל חפיסה מסומנת על ידי חיה אחרת, שמצויירת על גב הקלף.  </p>`]

var instructions07b1 = [`<p>בחלק מהחפיסות יש יותר קלפים ששווים ${OUTCOMES_TEXT.CARD_HIGH} נקודות מאשר קלפים ששווים ${OUTCOMES_TEXT.CARD_LOW} נקודות- אלו חפיסות ששוות יותר</p>`]

var instructions07b2 = [`<p>ובחלק מהחפיסות יש יותר קלפים ששווים ${OUTCOMES_TEXT.CARD_LOW} נקודות מאשר קלפים ששווים ${OUTCOMES_TEXT.CARD_HIGH} נקודות- אלו חפיסות ששוות פחות</p>`]


var instructions08 = [`<p>המטרה שלכם היא להרוויח כמה שיותר נקודות. כדי לעשות זאת, עליכם ללמוד באילו חפיסות קלפים יש סיכוי גבוה יותר להרוויח ${OUTCOMES_TEXT.CARD_HIGH} נקודות. בעלי החיים שעל גב כל קלף יעזרו לכם להבדיל בין חפיסות הקלפים </p>`]

var instructions09 = [`<p>כדי לעזור לכם ללמוד באילו חפיסות קלפים יש סיכוי גבוה יותר להרוויח יותר, תמיד נחשוף את הקלף ההפוך בסוף כל תור, גם אם לא בחרתם בו. <p></p>(שימו לב: תקבלו נקודות רק עבור הקלף שבחרתם) </p>`];

var instructions10 = [`<p>בסוף כל תור, הקלף ההפוך יוחזר לחפיסה והחפיסה תעורבב מחדש</p>`];

var instructions11a = [`<p>מיד ננסה כמה תורות עם הקלפים שלמעלה</p><p>השתמשו ב<b>${play_keys}</b></p>`];

var instructions11b = [`<p>נסו ללמוד אם חפיסת הארנב הכחול שווה יותר או שווה פחות מהקלף הגלוי. בחרו את הקלף ההפוך אם אתם חושבים שיש לו סיכוי גדול יותר להיות שווה ${OUTCOMES_TEXT.CARD_HIGH} נקודות מאשר ${OUTCOMES_TEXT.CARD_LOW} נקודות</p>`];


var instructions12 = [`<p>כל הכבוד.</p>`]

var instructions12a = [`<p>אולי שמתם לב שהחפיסה עם הארנב שווה יותר. אם בחרתם בקלף ההפוך לרוב הרווחתם ${OUTCOMES_TEXT.CARD_HIGH} נקודות </p>`];

var instructions13 = [`<p>עכשיו נתאמן עם חפיסה חדשה. השתמשו ב<b>${play_keys}</b></p>`];

var instructions14 = [`<p>כתזכורת: נסו ללמוד אם בממוצע החפיסה עם הסוס שווה יותר או שווה פחות מהקלף הגלוי. בחרו בקלף ההפוך אם אתם חושבים שיש לו סיכוי גדול יותר לתת ${OUTCOMES_TEXT.CARD_HIGH} נקודות מאשר ${OUTCOMES_TEXT.CARD_LOW} נקודות</p>`]

var instructions15 = [`<p><b>זכרו,</b> חלק מהחפיסות יהיו שוות פחות. עבור קלפים מחפיסות ששוות פחות,</p><p> תרוויחו יותר נקודות בממוצע על ידי בחירת הקלף הגלוי</p>`];

var instructions16 = [`<p>אולי שמתם לב שהחפיסה עם הסוס שווה פחות. אם בחרתם בקלף ההפוך לרוב הרווחתם רק ${OUTCOMES_TEXT.CARD_LOW} נקודות </p>`];


var instructions17 = [`<p>כל הכבוד! עכשיו אתם יודעים איך לשחק את המשחק. לפני שנתחיל, הנה שני רמזים</p>`];

var instructions18 = [`<p>בסוף המשחק, מספר הנקודות הכולל שצברתם <br>יומר ל<b>בונוס ביצועים.</b></p><p>לכן, עליכם לנסות לצבור כמה שיותר נקודות</p>`];

var instructions19 = [`<p>אנא קראו כל רמז בעיון</p>`];


var instructions20 = [`<p><b>רמז מס' 1:</b> חפיסה ששווה יותר או ששווה פחות היא כזו כל הזמן, ולא משתנה במהלך המשחק. או במילים אחרות הסיכוי לקבל ${OUTCOMES_TEXT.CARD_HIGH} נקודות מחבילה מסויימת נשאר אותו דבר לאורך המשחק  </p>`];


var instructions21 = [`<p><b>רמז מס' 2:</b> קלפים יכולים להופיע בצד שמאל או בצד ימין של המסך </p> <p> המיקום לא משנה את הסיכוי לקבל ${OUTCOMES_TEXT.CARD_HIGH}  או ${OUTCOMES_TEXT.CARD_LOW} נקודות</p>`];


var instructions22 = [`<p>מיד נשאל אתכם כמה שאלות על חוקי המשחק</p><p>עליכם לענות נכון על כל השאלות כדי להמשיך.`];


var  instructions23 = [`<p>כל הכבוד! עניתם נכון על כל השאלות</p>`];
var  instructions24 = [`<p> מיד נתחיל את המשחק. למשחק יש שני חלקים, בין החלקים תוכלו לקחת הפסקה. בזמן שאתם משחקים אנא הקדישו את מירב תשומת הלב שלכם למשחק </p>`];

var  instructions25 = [`<p>שימו לב, יהיו לכם שלוש שניות לבחור קלף בכל תור. אל תדאגו 3 שניות זה מלא זמן! </p>`];
var  instructions25a = [`<p>זכרו, כדי להרוויח הכי הרבה הנקודות, בחרו את הקלף ההפוך (עם בעל החיים) אם אתם חושבים שיש לו סיכוי גדול יותר לתת לכם ${OUTCOMES_TEXT.CARD_HIGH} נקודות מאשר ${OUTCOMES_TEXT.CARD_LOW} נקודות. אחרת, בחרו את הקלף הגלוי.</p>`];

var  instructions26 = [`<p>מיד נתחיל <b>בחלק הראשון</b>. חלק זה ייקח כ 8 דקות</p><p>לחצו 'הבא' כשאתם מוכנים להתחיל</p>`];


var  instructions27a = [`<p>סיימתם עם החלק הראשון! שימו לב, מיד הנתונים ישמרו במחשב. לחצו הבא כדי לשמור ולהתחיל בהפסקה</p>`];

var  instructions27 = [`<p>קחו כמה רגעים הפסקה, לחצו 'הבא' כאשר אתם מוכנים להמשיך</p>`];
var  instructions28 = [`<p>מיד נתחיל <b>בחלק השני</b>. חלק זה ייקח כ 8 דקות</p><p>לחצו 'הבא' כשאתם מוכנים להתחיל</p>`];


var  instructions31 = [`<p>כל הכבוד! סיימתם את המשחק. לחצו 'הבא' כדי לסיים ולשמור את נתוני המשחק </p>`];

var quiz_00 = [`<p>כדי להמשיך, אנא ענו על השאלות הבאות: </p>`];

var comprehension_prompt_1 = [` חפיסות מסוימות (מסומנות על ידי בעלי חיים שונים) שוות יותר מחפיסות אחרות. כלומר, יש בהן יותר קלפים בעלי ערך גבוה`];
var comprehension_prompt_2 = [` אזכה בנקודות גם עבור הקלפים שלא בחרתי.`];
var comprehension_prompt_3 = [`חפיסה ששווה יותר תשאר כזו לאורך כל המשחק.`];
var comprehension_prompt_4 = [` הסיכוי שקלף יהיה בעל ערך גבוה או נמוך תלוי בצד שבו הוא נמצא`];
var comprehension_prompt_5 = [` הנקודות שארוויח ישפיעו על בונוס הביצועים שלי.`];

var comprehension_options =  [`נכון`, `לא נכון`];


var comprehension_review_1 = [`זכרו, חלק מהחפיסות שוות יותר- כלומר, יש בהן יותר קלפים ששווים ${OUTCOMES_TEXT.CARD_HIGH} נקודות מאשר ${OUTCOMES_TEXT.CARD_LOW} נקודות.`];
var comprehension_review_2 = [`תקבלו נקודות רק עבור הקלפים שתבחרו`];
var comprehension_review_3 = [`החפיסות לא משתנות לאורך כל המשחק- חפיסות ששוות יותר, ישארו שוות יותר ואלו ששוות פחות ישארו שוות פחות`];
var comprehension_review_4 = [`זה שהקלף בצד ימין או בצד שמאל לא משנה את הסיכוי שהקלף ההפוך בעל ערך גבוה או בעל ערך נמוך`];
var comprehension_review_5 = [`מספר הנקודות שתצברו ישפיע על כמה כסף תקבלו בסוף הניסוי.`];

var help_00 = ["<p>נראה שאתם מתקשים לבחור בקלף הנכון</p>"];
var help_01 = ["<p>נסו ללמוד איזה קלף (הקלף ההפוך או הקלף הגלוי) נותן לכם יותר נקודות בממוצע</p><p>בחרו את הקלף שלדעתכם נותן יותר נקודות!</p>"];


var feedback_err = [` תשובה לא נכונה. שימו לב לרמזים הבאים`];
var feedback_pos = [` תשובה נכונה! כל הכבוד`];


var timeouterr = ["<p>לא בחרתם בקלף והזמן אזל. אנא נסו לבחור קלף יותר מהר בתור הבא. </p>"]
